# Data Carpentry SQL Exercise

This exercise continues to use the DSASurvey fictional data and focused on applying SQL String Functions for performing basic data carpentry on several columns of "bad" data.

We will be using some of the SQL string functions (upper, trim, substr, instr) so we can better tidy our data.

**[SQL Function](https://www.sqlitetutorial.net/sqlite-string-functions/) Descriptions**
* [upper](https://www.sqlitetutorial.net/sqlite-functions/sqlite-upper/) - converts string to upper case 
* [trim](https://www.sqlitetutorial.net/sqlite-functions/sqlite-trim/) - removes all leading and trailing white space (e.g. spaces) 
* [substr](https://www.sqlitetutorial.net/sqlite-functions/sqlite-substr/) - returns a substring from another string with a specified starting position and length 
* [instr](https://www.sqlitetutorial.net/sqlite-functions/sqlite-instr/) - returns the starting postions of the first occurrence of a string in another string

# 1 - Add the correct SQL Extention as used in the LAB and Practice to allow the "SQL Magic - %%sql" to execute.

## Add the correct code below:

In [1]:
%load_ext sql

# 2 - Issue the correct connection string to connect to the DSASurvey SQLite Database ('DSASurvey') as used in the LAB and Practice.

## Add the correct code below:

In [2]:
%sql sqlite:////dsa/data/DSA-7030/DSASurvey.db

'Connected: @/dsa/data/DSA-7030/DSASurvey.db'

# 3 - Utilizing the appropriate string functions as described above, using SQL, separate the Name column into FirstName and LastName columns standardizing to all UPPER CASE and selecting all other columns too:

In [3]:
%%sql
select * from DSASurvey;

 * sqlite:////dsa/data/DSA-7030/DSASurvey.db
Done.

[(1, 'John Smith', 33, 'Portsmith, DE', 'C', 7, 3),
 (2, 'Mary Wilson', 28, 'Los Angles, CA', 'Python', 10, 6),
 (3, 'Brook Tumay', 61, 'Miami, FL', 'R,Pandas', 3, 2),
 (4, 'Vieat Olson', 63, 'St. Louis, MO', 'Java', 6, 8),
 (5, 'Constance Martin', 22, 'Dodge City, KS', 'Visual Basic', 7, 9),
 (6, 'Carlos Vialli', 39, 'Benton, AR', 'C Sharp', 4, 3),
 (7, 'Benny Schrartz', 41, 'Dallas, Tx', 'C++', 8, 5),
 (8, 'John Smith', 22, 'Portsmith, DE', 'C', 4, 3),
 (9, 'Edgar Thupton ', 29, 'Aurora, CO', 'Fortran', 8, 7),
 (10, 'Cindy Wagener', '5 5', 'Boston, Ma', 'Python', 10, 4)]

In [7]:
%%sql
Select *,
upper(trim(substr(trim(Name),1,instr(trim(Name),' ')-1))) as FirstName, 
upper(trim(substr(trim(Name),instr(trim(Name),' ')+1))) as LastName 
FROM DSASurvey;

 * sqlite:////dsa/data/DSA-7030/DSASurvey.db
Done.

[(1, 'John Smith', 33, 'Portsmith, DE', 'C', 7, 3, 'JOHN', 'SMITH'),
 (2, 'Mary Wilson', 28, 'Los Angles, CA', 'Python', 10, 6, 'MARY', 'WILSON'),
 (3, 'Brook Tumay', 61, 'Miami, FL', 'R,Pandas', 3, 2, 'BROOK', 'TUMAY'),
 (4, 'Vieat Olson', 63, 'St. Louis, MO', 'Java', 6, 8, 'VIEAT', 'OLSON'),
 (5, 'Constance Martin', 22, 'Dodge City, KS', 'Visual Basic', 7, 9, 'CONSTANCE', 'MARTIN'),
 (6, 'Carlos Vialli', 39, 'Benton, AR', 'C Sharp', 4, 3, 'CARLOS', 'VIALLI'),
 (7, 'Benny Schrartz', 41, 'Dallas, Tx', 'C++', 8, 5, 'BENNY', 'SCHRARTZ'),
 (8, 'John Smith', 22, 'Portsmith, DE', 'C', 4, 3, 'JOHN', 'SMITH'),
 (9, 'Edgar Thupton ', 29, 'Aurora, CO', 'Fortran', 8, 7, 'EDGAR', 'THUPTON'),
 (10, 'Cindy Wagener', '5 5', 'Boston, Ma', 'Python', 10, 4, 'CINDY', 'WAGENER')]

# Save your Notebook, then `File > Close and Halt`